emoji_modifier = [
    "🏻",  # U+1F3FB EMOJI MODIFIER FITZPATRICK TYPE-1-2
    "🏼",  # U+1F3FC EMOJI MODIFIER FITZPATRICK TYPE-3
    "🏽",  # U+1F3FD EMOJI MODIFIER FITZPATRICK TYPE-4
    "🏾",  # U+1F3FE EMOJI MODIFIER FITZPATRICK TYPE-5
    "🏿"  # U+1F3FF EMOJI MODIFIER FITZPATRICK TYPE-6
]

group = {"Activities": "活動",
         "Animals & Nature": "動物と自然",
         "Flags": "旗",
         "Food & Drink": "飲み物と食べ物",
         "Objects": "物",
         "Smileys & People": "スマイリーと人々",
         "Symbols": "記号",
         "Travel & Places": "旅行と場所",
         'Smileys & Emotion': "スマイリーと感情", #12.0
         'People & Body': "人と体",
         'Component': "要素"
         }

subgroup = {"alphanum": "文字",
            "animal-amphibian": "動物 両生類",
            "animal-bird": "動物 鳥類",
            "animal-bug": "動物 虫",
            "animal-mammal": "動物 哺乳類",
            "animal-marine": "動物 海洋",
            "animal-reptile": "動物 両生類",
            "arrow": "矢印",
            "arts & crafts": "芸術と工芸",
            "av-symbol": "AV記号",
            "award-medal": "表彰メダル",
            "body": "体",
            "book-paper": "書籍や紙",
            "cat-face": "猫の顔",
            "clothing": "衣服",
            "computer": "コンピューター",
            "country-flag": "国旗",
            "dishware": "食器",
            "drink": "飲み物",
            "emotion": "感情",
            "event": "イベント",
            "face-fantasy": "顔 ファンタジー",
            "face-negative": "顔 ネガティブ",
            "face-neutral": "顔 ニュートラル",
            "face-positive": "顔 ポジティブ",
            "face-role": "顔 役割",
            "face-sick": "顔 病気",
            "family": "家族",
            "flag": "旗",
            "food-asian": "食べ物 アジア料理",
            "food-fruit": "食べ物 フルーツ",
            "food-prepared": "食べ物 加工品",
            "food-sweet": "食べ物 スイーツ",
            "food-vegetable": "食べ物 野菜",
            "game": "ゲーム",
            "geometric": "図形",
            "hotel": "ホテル",
            "household": "家庭",
            "keycap": "キーキャップ",
            "light & video": "光と映像",
            "lock": "鍵",
            "mail": "手紙",
            "medical": "医療",
            "money": "お金",
            "monkey-face": "猿の顔",
            "music": "音楽",
            "musical-instrument": "楽器",
            "office": "オフィス",
            "other-object": "その他 オブジェクト",
            "other-symbol": "その他 シンボル",
            "person": "人",
            "person-activity": "人 活動",
            "person-fantasy": "人 ファンタジー",
            "person-gesture": "人 ジェスチャー",
            "person-role": "人 役割",
            "person-sport": "人 スポーツ",
            "phone": "電話",
            "place-building": "場所 建物",
            "place-geographic": "場所 地理",
            "place-map": "場所 地図",
            "place-other": "場所 その他",
            "place-religious": "場所 宗教",
            "plant-flower": "植物 花",
            "plant-other": "植物 その他",
            "religion": "宗教",
            "science": "科学",
            "skin-tone": "肌の色",
            "sky & weather": "空と天気",
            "sound": "サウンド",
            "sport": "スポーツ",
            "subdivision-flag": "地区の旗",
            "time": "時間",
            "tool": "道具",
            "transport-air": "乗り物 空中",
            "transport-ground": "乗り物 陸上",
            "transport-sign": "標識",
            "transport-water": "乗り物 水上",
            "warning": "警告",
            "writing": "筆記",
            "zodiac": "星座",
            "face-smiling": "顔 スマイル", #12.0
            "face-affection":"顔 愛情",
            "face-tongue":"顔 舌",
            "face-hand":"顔 手",
            "face-neutral-skeptical":"顔 中立的 懐疑的",
            "face-sleepy":"顔 眠い",
            "face-unwell":"顔 体調不良",
            "face-hat":"顔 帽子",
            "face-glasses":"顔 眼鏡",
            "face-concerned":"顔 心配",
            "face-costume":"顔 仮装",
            "hand-fingers-open":"手 開いた指",
            "hand-fingers-partial":"手 一部の指",
            "hand-single-finger":"手 一本指",
            "hand-fingers-closed":"手 閉じた指",
            "hands":"手",
            "hand-prop":"手 小道具",
            "body-parts":"体の一部",
            "person-resting":"人 休息",
            "person-symbol":"人 シンボル",
            "hair-style":"ヘアスタイル",
            "food-marine":"食べ物 海産物",
            "gender":"性別"
            }

# https://unicode.org/Public/emoji/11.0/emoji-test.txt
# https://ja.wikipedia.org/wiki/%E5%9B%BD%E6%97%97%E3%81%AE%E4%B8%80%E8%A6%A7
flag = {"🇦🇨": "アセンション島",  # Ascension Island
        "🇦🇩": "アンドラ",  # Andorra
        "🇦🇪": "アラブ首長国連邦",  # United Arab Emirates
        "🇦🇫": "アフガニスタン",  # Afghanistan
        "🇦🇬": "アンティグア・バーブーダ",  # Antigua & Barbuda
        "🇦🇮": "アンギラ",  # Anguilla
        "🇦🇱": "アルバニア",  # Albania
        "🇦🇲": "アルメニア",  # Armenia
        "🇦🇴": "アンゴラ",  # Angola
        "🇦🇶": "南極大陸",  # Antarctica
        "🇦🇷": "アルゼンチン",  # Argentina
        "🇦🇸": "アメリカ領サモア",  # American Samoa
        "🇦🇹": "オーストリア",  # Austria
        "🇦🇺": "オーストラリア",  # Australia
        "🇦🇼": "アルバ",  # Aruba
        "🇦🇽": "オーランド諸島",  # Åland Islands
        "🇦🇿": "アゼルバイジャン",  # Azerbaijan
        "🇧🇦": "ボスニア・ヘルツェゴビナ",  # Bosnia & Herzegovina
        "🇧🇧": "バルバドス",  # Barbados
        "🇧🇩": "バングラデシュ",  # Bangladesh
        "🇧🇪": "ベルギー",  # Belgium
        "🇧🇫": "ブルキナファソ",  # Burkina Faso
        "🇧🇬": "ブルガリア",  # Bulgaria
        "🇧🇭": "バーレーン",  # Bahrain
        "🇧🇮": "ブルンジ",  # Burundi
        "🇧🇯": "ベナン",  # Benin
        "🇧🇱": "サン・バルテルミー島",  # St. Barthélemy
        "🇧🇲": "バミューダ",  # Bermuda
        "🇧🇳": "ブルネイ",  # Brunei
        "🇧🇴": "ボリビア",  # Bolivia
        "🇧🇶": "ボネール、シント・ユースタティウスおよびサバ",  # Caribbean Netherlands
        "🇧🇷": "ブラジル",  # Brazil
        "🇧🇸": "バハマ",  # Bahamas
        "🇧🇹": "ブータン",  # Bhutan
        "🇧🇻": "ブーベ島",  # Bouvet Island
        "🇧🇼": "ボツワナ",  # Botswana
        "🇧🇾": "ベラルーシ",  # Belarus
        "🇧🇿": "ベリーズ",  # Belize
        "🇨🇦": "カナダ",  # Canada
        "🇨🇨": "ココス諸島",  # Cocos (Keeling) Islands
        "🇨🇩": "コンゴ民主共和国",  # Congo - Kinshasa
        "🇨🇫": "中央アフリカ共和国",  # Central African Republic
        "🇨🇬": "コンゴ共和国",  # Congo - Brazzaville
        "🇨🇭": "スイス",  # Switzerland
        "🇨🇮": "コートジボワール",  # Côte d’Ivoire
        "🇨🇰": "クック諸島",  # Cook Islands
        "🇨🇱": "チリ",  # Chile
        "🇨🇲": "カメルーン",  # Cameroon
        "🇨🇳": "中国",  # China
        "🇨🇴": "コロンビア",  # Colombia
        "🇨🇵": "クリッパートン島",  # Clipperton Island
        "🇨🇷": "コスタリカ",  # Costa Rica
        "🇨🇺": "キューバ",  # Cuba
        "🇨🇻": "カーボベルデ",  # Cape Verde
        "🇨🇼": "キュラソー島",  # Curaçao
        "🇨🇽": "クリスマス島",  # Christmas Island
        "🇨🇾": "キプロス",  # Cyprus
        "🇨🇿": "チェコ",  # Czechia
        "🇩🇪": "ドイツ",  # Germany
        "🇩🇬": "ディエゴガルシア島",  # Diego Garcia
        "🇩🇯": "ジブチ",  # Djibouti
        "🇩🇰": "デンマーク",  # Denmark
        "🇩🇲": "ドミニカ国",  # Dominica
        "🇩🇴": "ドミニカ共和国",  # Dominican Republic
        "🇩🇿": "アルジェリア",  # Algeria
        "🇪🇦": "セウタとメリリャ",  # Ceuta & Melilla
        "🇪🇨": "エクアドル",  # Ecuador
        "🇪🇪": "エストニア",  # Estonia
        "🇪🇬": "エジプト",  # Egypt
        "🇪🇭": "西サハラ",  # Western Sahara
        "🇪🇷": "エリトリア",  # Eritrea
        "🇪🇸": "スペイン",  # Spain
        "🇪🇹": "エチオピア",  # Ethiopia
        "🇪🇺": "欧州連合",  # European Union
        "🇫🇮": "フィンランド",  # Finland
        "🇫🇯": "フィジー",  # Fiji
        "🇫🇰": "フォークランド諸島",  # Falkland Islands
        "🇫🇲": "ミクロネシア",  # Micronesia
        "🇫🇴": "フェロー諸島",  # Faroe Islands
        "🇫🇷": "フランス",  # France
        "🇬🇦": "ガボン",  # Gabon
        "🇬🇧": "イギリス",  # United Kingdom
        "🇬🇩": "グレナダ",  # Grenada
        "🇬🇪": "ジョージア",  # Georgia
        "🇬🇫": "フランス領ギアナ",  # French Guiana
        "🇬🇬": "ガーンジー",  # Guernsey
        "🇬🇭": "ガーナ",  # Ghana
        "🇬🇮": "ジブラルタル",  # Gibraltar
        "🇬🇱": "グリーンランド",  # Greenland
        "🇬🇲": "ガンビア",  # Gambia
        "🇬🇳": "ギニア",  # Guinea
        "🇬🇵": "グアドループ",  # Guadeloupe
        "🇬🇶": "赤道ギニア",  # Equatorial Guinea
        "🇬🇷": "ギリシャ",  # Greece
        "🇬🇸": "サウスジョージア・サウスサンドウィッチ諸島",  # South Georgia & South Sandwich Islands
        "🇬🇹": "グアテマラ",  # Guatemala
        "🇬🇺": "グアム",  # Guam
        "🇬🇼": "ギニアビサウ",  # Guinea-Bissau
        "🇬🇾": "ガイアナ",  # Guyana
        "🇭🇰": "香港",  # Hong Kong SAR China
        "🇭🇲": "ハード島とマクドナルド諸島",  # Heard & McDonald Islands
        "🇭🇳": "ホンジュラス",  # Honduras
        "🇭🇷": "クロアチア",  # Croatia
        "🇭🇹": "ハイチ",  # Haiti
        "🇭🇺": "ハンガリー",  # Hungary
        "🇮🇨": "カナリア諸島",  # Canary Islands
        "🇮🇩": "インドネシア",  # Indonesia
        "🇮🇪": "アイルランド",  # Ireland
        "🇮🇱": "イスラエル",  # Israel
        "🇮🇲": "マン島",  # Isle of Man
        "🇮🇳": "インド",  # India
        "🇮🇴": "イギリス領インド洋地域",  # British Indian Ocean Territory
        "🇮🇶": "イラク",  # Iraq
        "🇮🇷": "イラン",  # Iran
        "🇮🇸": "アイスランド",  # Iceland
        "🇮🇹": "イタリア",  # Italy
        "🇯🇪": "ジャージー",  # Jersey
        "🇯🇲": "ジャマイカ",  # Jamaica
        "🇯🇴": "ヨルダン",  # Jordan
        "🇯🇵": "日本",  # Japan
        "🇰🇪": "ケニア",  # Kenya
        "🇰🇬": "キルギス",  # Kyrgyzstan
        "🇰🇭": "コロンビア",  # Cambodia
        "🇰🇮": "キリバス",  # Kiribati
        "🇰🇲": "コモロ",  # Comoros
        "🇰🇳": "セントクリストファー・ネイビス",  # St. Kitts & Nevis
        "🇰🇵": "北朝鮮",  # North Korea
        "🇰🇷": "韓国",  # South Korea
        "🇰🇼": "クウェート",  # Kuwait
        "🇰🇾": "ケイマン諸島",  # Cayman Islands
        "🇰🇿": "カザフスタン",  # Kazakhstan
        "🇱🇦": "ラオス",  # Laos
        "🇱🇧": "レバノン",  # Lebanon
        "🇱🇨": "セントルシア",  # St. Lucia
        "🇱🇮": "リヒテンシュタイン",  # Liechtenstein
        "🇱🇰": "スリランカ",  # Sri Lanka
        "🇱🇷": "リベリア",  # Liberia
        "🇱🇸": "レソト",  # Lesotho
        "🇱🇹": "リトアニア",  # Lithuania
        "🇱🇺": "ルクセンブルグ",  # Luxembourg
        "🇱🇻": "ラトビア",  # Latvia
        "🇱🇾": "リビア",  # Libya
        "🇲🇦": "モロッコ",  # Morocco
        "🇲🇨": "モナコ",  # Monaco
        "🇲🇩": "モルドバ",  # Moldova
        "🇲🇪": "モンテネグロ",  # Montenegro
        "🇲🇫": "セント・マーチン島",  # St. Martin
        "🇲🇬": "マダガスカル",  # Madagascar
        "🇲🇭": "マーシャル諸島",  # Marshall Islands
        "🇲🇰": "マケドニア",  # Macedonia
        "🇲🇱": "マリ",  # Mali
        "🇲🇲": "ミャンマー",  # Myanmar (Burma)
        "🇲🇳": "モンゴル",  # Mongolia
        "🇲🇴": "マカオ",  # Macau SAR China
        "🇲🇵": "北マリアナ諸島",  # Northern Mariana Islands
        "🇲🇶": "マルティニーク",  # Martinique
        "🇲🇷": "モーリタニア",  # Mauritania
        "🇲🇸": "モントセラト",  # Montserrat
        "🇲🇹": "マルタ",  # Malta
        "🇲🇺": "モーリシャス",  # Mauritius
        "🇲🇻": "モルディブ",  # Maldives
        "🇲🇼": "マラウィ",  # Malawi
        "🇲🇽": "メキシコ",  # Mexico
        "🇲🇾": "マレーシア",  # Malaysia
        "🇲🇿": "モザンビーク",  # Mozambique
        "🇳🇦": "ナミビア",  # Namibia
        "🇳🇨": "ニューカレドニア",  # New Caledonia
        "🇳🇪": "ニジェール",  # Niger
        "🇳🇫": "ノーフォーク島",  # Norfolk Island
        "🇳🇬": "ナイジェリア",  # Nigeria
        "🇳🇮": "ニカラグア",  # Nicaragua
        "🇳🇱": "オランダ",  # Netherlands
        "🇳🇴": "ノルウェー",  # Norway
        "🇳🇵": "ネパール",  # Nepal
        "🇳🇷": "ナウル",  # Nauru
        "🇳🇺": "ニウエ",  # Niue
        "🇳🇿": "ニュージーランド",  # New Zealand
        "🇴🇲": "オマーン",  # Oman
        "🇵🇦": "パナマ",  # Panama
        "🇵🇪": "ペルー",  # Peru
        "🇵🇫": "フランス領ポリネシア",  # French Polynesia
        "🇵🇬": "パプアニューギニア",  # Papua New Guinea
        "🇵🇭": "フィリピン",  # Philippines
        "🇵🇰": "パキスタン",  # Pakistan
        "🇵🇱": "ポーランド",  # Poland
        "🇵🇲": "サンピエール島・ミクロン島",  # St. Pierre & Miquelon
        "🇵🇳": "ピトケアン諸島",  # Pitcairn Islands
        "🇵🇷": "プエルトリコ",  # Puerto Rico
        "🇵🇸": "パレスチナ自治区",  # Palestinian Territories
        "🇵🇹": "ポルトガル",  # Portugal
        "🇵🇼": "パラオ",  # Palau
        "🇵🇾": "パラグアイ",  # Paraguay
        "🇶🇦": "カタール",  # Qatar
        "🇷🇪": "レユニオン",  # Réunion
        "🇷🇴": "ルーマニア",  # Romania
        "🇷🇸": "セルビア",  # Serbia
        "🇷🇺": "ロシア",  # Russia
        "🇷🇼": "ルワンダ",  # Rwanda
        "🇸🇦": "サウジアラビア",  # Saudi Arabia
        "🇸🇧": "ソロモン諸島",  # Solomon Islands
        "🇸🇨": "セーシェル",  # Seychelles
        "🇸🇩": "スーダン",  # Sudan
        "🇸🇪": "スウェーデン",  # Sweden
        "🇸🇬": "シンガポール",  # Singapore
        "🇸🇭": "セントヘレナ",  # St. Helena
        "🇸🇮": "スロベニア",  # Slovenia
        "🇸🇯": "スヴァールバル諸島およびヤンマイエン島",  # Svalbard & Jan Mayen
        "🇸🇰": "スロバキア",  # Slovakia
        "🇸🇱": "シエラレオネ",  # Sierra Leone
        "🇸🇲": "サンマリノ",  # San Marino
        "🇸🇳": "セネガル",  # Senegal
        "🇸🇴": "ソマリア",  # Somalia
        "🇸🇷": "スリナム",  # Suriname
        "🇸🇸": "南スーダン",  # South Sudan
        "🇸🇹": "サントメ・プリンシペ",  # São Tomé & Príncipe
        "🇸🇻": "エルサルバドル",  # El Salvador
        "🇸🇽": "シント・マールテン",  # Sint Maarten
        "🇸🇾": "シリア",  # Syria
        "🇸🇿": "スワジランド",  # Swaziland
        "🇹🇦": "トリスタンダクーニャ",  # Tristan da Cunha
        "🇹🇨": "タークス・カイコス諸島",  # Turks & Caicos Islands
        "🇹🇩": "チャド",  # Chad
        "🇹🇫": "フランス領南方・南極地域",  # French Southern Territories
        "🇹🇬": "トーゴ",  # Togo
        "🇹🇭": "タイ",  # Thailand
        "🇹🇯": "タジキスタン",  # Tajikistan
        "🇹🇰": "トケラウ",  # Tokelau
        "🇹🇱": "東ティモール",  # Timor-Leste
        "🇹🇲": "トルクメニスタン",  # Turkmenistan
        "🇹🇳": "チュニジア",  # Tunisia
        "🇹🇴": "トンガ",  # Tonga
        "🇹🇷": "トルコ",  # Turkey
        "🇹🇹": "トリニダード・トバゴ",  # Trinidad & Tobago
        "🇹🇻": "ツバル",  # Tuvalu
        "🇹🇼": "台湾",  # Taiwan
        "🇹🇿": "タンザニア",  # Tanzania
        "🇺🇦": "ウクライナ",  # Ukraine
        "🇺🇬": "ウガンダ",  # Uganda
        "🇺🇲": "合衆国領有小離島",  # U.S. Outlying Islands
        "🇺🇳": "国際連合",  # United Nations
        "🇺🇸": "アメリカ合衆国",  # United States
        "🇺🇾": "ウルグアイ",  # Uruguay
        "🇺🇿": "ウズベキスタン",  # Uzbekistan
        "🇻🇦": "バチカン市国",  # Vatican City
        "🇻🇨": "セントビンセント・グレナディーン",  # St. Vincent & Grenadines
        "🇻🇪": "ベネズエラ",  # Venezuela
        "🇻🇬": "イギリス領ヴァージン諸島",  # British Virgin Islands
        "🇻🇮": "アメリカ領ヴァージン諸島",  # U.S. Virgin Islands
        "🇻🇳": "ベトナム",  # Vietnam
        "🇻🇺": "バヌアツ",  # Vanuatu
        "🇼🇫": "ウォリス・フツナ",  # Wallis & Futuna
        "🇼🇸": "サモア",  # Samoa
        "🇽🇰": "コソボ",  # Kosovo
        "🇾🇪": "イエメン",  # Yemen
        "🇾🇹": "マヨット",  # Mayotte
        "🇿🇦": "南アフリカ",  # South Africa
        "🇿🇲": "ザンビア",  # Zambia
        "🇿🇼": "ジンバブエ"  # Zimbabwe
        }

flag_keyword = ["フラグ", "フラッグ", "旗", "国旗"]
